import "../scss/style.scss";

import "./libs/dynamic_adapt.js";

import * as flsFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
flsFunctions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
flsFunctions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
flsFunctions.addLoadedClass();
/* Модуль для работы с меню (Бургер) */
flsFunctions.menuOpen();
/* Учет плавающей панели на мобильных устройствах при 100vh */
flsFunctions.fullVHfix();

/*
Модуль работы со спойлерами
*/
flsFunctions.spollers();

/*
Модуль работы с табами
*/
flsFunctions.tabs();

// Работа с формами ========================================================================================================================================================================================================================================================
import * as flsForms from "./files/forms/forms.js";

/* Работа с полями формы. Добавление классов, работа с placeholder */
flsForms.formFieldsInit();

/* Oтправка формы со встроенной валидацией полей. false - отключит валидацию */
flsForms.formSubmit(true);

/* Модуль работы с select */
import "./files/forms/select.js";

// Модуль работы с попапами (hystmodal) ===================================================================================================================================================================================================================================================================================
import "./files/popups.js";

// Работа со слайдером (Swiper) ========================================================================================================================================================================================================================================================
import "./files/sliders.js";

/* Подключаем файл со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================